Revit 2024 API
ExternalServiceId Constructor
Creates a new ExternalServiceId instance.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ExternalServiceId(
	Guid guid
)
Visual Basic
Public Sub New ( _
	guid As Guid _
)
Visual C++
public:
ExternalServiceId(
	Guid guid
)
Parameters
guid
Type: System.Guid
The identifier for the ExternalServiceId.
See Also
ExternalServiceId Class
Autodesk.Revit.DB.ExternalService Namespace